Repository: SaraSerrano7/DrawApp
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ca, es

source: square
ca: quadrat
es: cuadrado

source: line
ca: linia
es: linea

source: circle
ca: cercle
es: circulo

source: red
ca: vermell
es: rojo

source: green
ca: verd
es: verde

source: blue
ca: blau
es: azul

source: big
ca: gran
es: grande

source: little
ca: petit
es: enana

source: medium
ca: mitja
es: mediana

source: Your figure
ca: La teva figura
es: Tu figura

source: color_wanted
es: color deseado

source: shape_wanted
es: figura deseada

source: size_wanted
es: Grandeza deseada

source: Select which shape you want to draw: line, circle or square.
ca: Selecciona quina figura vols dibuixar: linia, cercle o quadrat
es: Selecciona que forma quieres dibujar: linea, circulo o cuadrado.

source: You misspelled the shape. Please, write it again.
ca: Has escrit malament el nom de la figura. Torna-ho a escriure.
es: Has escrito mal el nombre de la figura. Por favor, escribelo de nuevo.

source: What do you want to draw? Line, circle or square?
ca: Que vols dibuixar? Linia, cercle o quadrat?
es: Que quieres dibujar? Una linea, un circulo o un cuadrado?

source: , now select color: red, green or blue.
ca: , ara selecciona el color: vermell, verd o blau
es: , ahora selecciona un color: rojo, verde o azul.

source: You selected to draw a
ca: Has seleccionat un/a
es: Has elegido dibujar un/a

source: You misspelled the color. Please, write it again.
ca: Has escrit malament el color. Torna-ho a escriure.
es: Has escrito mal el color. Por favor, escribelo de nuevo.

source: What color do you want for your shape? Red, green or blue?
ca: Quin color vols per a la teva figura? Vermell, verd o blau?
es: Que color quieres para tu figura? Rojo, verde o azul?

source: You selected a
ca: Has seleccionat un/a
es: Has seleccionado un

source: , now select size: little, medium or big.
ca: , ara selecciona el tamany: petit, mitja o gran.
es: , ahora selecciona la grandeza: enana, mediana o grande.

source: You misspelled the size. Please, write it again.
ca: Has escrit malament el tamany. Torna-ho a escriure.
es: Has escrito mal la grandeza de la figura. Por favor, escribelo de nuevo.

source: What size do you want for your shape? Little, medium or big?
ca: Quin tamany vols per a la teva figura?
es: Que medida quieres para tu figura? Enana, mediana o grande?

source: Usage: ./main.py <language>
es: Uso: ./main.py <idioma>
